<h2>Import Data Training</h2>

In [5]:
import pandas as pd
df = pd.read_csv("train.csv")
df = df.set_index("id")

In [4]:
df.head()

,id,Umur,Kelas Pekerja,Berat Akhir,Pendidikan,Jmlh Tahun Pendidikan,Status Perkawinan,Pekerjaan,Jenis Kelamin,Keuntungan Kapital,Kerugian Capital,Jam per Minggu,Gaji
0,0,21,Wiraswasta,242912,SMA,9,Belum Pernah Menikah,Servis Lainnya,Perempuan,0.0,0.0,35.0,<=7jt
1,1,49,Wiraswasta,140782,10th,6,Cerai,Ekesekutif Managerial,Perempuan,0.0,0.0,40.0,<=7jt
2,2,44,Wiraswasta,120057,D3,12,Menikah,Ekesekutif Managerial,Laki2,61404000.0,0.0,45.0,>7jt
3,3,24,Wiraswasta,194630,Sarjana,13,Belum Pernah Menikah,Spesialis,Laki2,0.0,0.0,35.0,<=7jt
4,4,33,Wiraswasta,219619,Master,14,Menikah,Spesialis,Laki2,210336000.0,0.0,40.0,>7jt

In [6]:
df.shape

(35994, 12)

In [8]:
df.describe()

,Umur,Berat Akhir,Jmlh Tahun Pendidikan,Keuntungan Kapital,Kerugian Capital,Jam per Minggu
count,35994.000000,3.599400e+04,35994.000000,3.599400e+04,3.599400e+04,35994.000000
mean,38.664555,1.899318e+05,10.079874,1.503923e+07,1.217974e+06,40.435656
std,13.676266,1.058023e+05,2.574813,1.029919e+08,5.631544e+06,12.367552
min,17.000000,1.228500e+04,1.000000,0.000000e+00,0.000000e+00,1.000000
25%,28.000000,1.177670e+05,9.000000,0.000000e+00,0.000000e+00,40.000000
50%,37.000000,1.784665e+05,10.000000,0.000000e+00,0.000000e+00,40.000000
75%,48.000000,2.379185e+05,12.000000,0.000000e+00,0.000000e+00,45.000000
max,90.000000,1.490400e+06,16.000000,1.399986e+09,6.098400e+07,99.000000

<h2>Membuang Data Yang Kurang Relevan</h2>

In [161]:
df1 = df.drop(['Kelas Pekerja','Pendidikan','Status Perkawinan','Pekerjaan','Jenis Kelamin'], axis='columns')
df1.head()

,Umur,Berat Akhir,Jmlh Tahun Pendidikan,Keuntungan Kapital,Kerugian Capital,Jam per Minggu,Gaji
id,,,,,,,
0,21,242912,9,0.0,0.0,35.0,<=7jt
1,49,140782,6,0.0,0.0,40.0,<=7jt
2,44,120057,12,61404000.0,0.0,45.0,>7jt
3,24,194630,13,0.0,0.0,35.0,<=7jt
4,33,219619,14,210336000.0,0.0,40.0,>7jt

<h2> Cek Data Bernilai NaN </h2>

In [15]:
df1['Keuntungan Kapital'].isnull().any()

False

In [17]:
df1['Kerugian Capital'].isnull().any()

False

In [18]:
df1['Jam per Minggu'].isnull().any()

False

In [19]:
df1['Gaji'].isnull().any()

False

In [162]:
df2 = df1
df2['Gaji > 7jt'] = df2['Gaji'].apply(lambda x : 1 if x == '>7jt' else 0)
df2 = df2.drop('Gaji',axis='columns')
df2.head()

,Umur,Berat Akhir,Jmlh Tahun Pendidikan,Keuntungan Kapital,Kerugian Capital,Jam per Minggu,Gaji > 7jt
id,,,,,,,
0,21,242912,9,0.0,0.0,35.0,0
1,49,140782,6,0.0,0.0,40.0,0
2,44,120057,12,61404000.0,0.0,45.0,1
3,24,194630,13,0.0,0.0,35.0,0
4,33,219619,14,210336000.0,0.0,40.0,1

<h2>Membuat Model</h2>

In [163]:
## Memisahkan antara x dan y 
x = df2.drop('Gaji > 7jt',axis='columns')
y = df2['Gaji > 7jt']


from sklearn.model_selection import train_test_split
X_train, X_test, y_train, y_test = train_test_split(x,y, test_size=0.2)

In [164]:
## Logistic Regression
from sklearn.linear_model import LogisticRegression
lr = LogisticRegression()
lr.fit(X_train, y_train)
lr.score(X_test,y_test)

0.7992776774552021

In [165]:
## Linear Regression
from sklearn.linear_model import LinearRegression
linearReg = LinearRegression(fit_intercept=True)
linearReg.fit(X_train, y_train)
linearReg.score(X_test,y_test)

0.22272533345648915

In [144]:
## Decission Tree
from sklearn.tree import DecisionTreeClassifier
dt = DecisionTreeClassifier()
dt.fit(X_train, y_train)
dt.score(X_test,y_test)

0.8216418947075983

In [166]:
 ## Naive Bayes
from sklearn.naive_bayes import GaussianNB
gnb = GaussianNB()
gnb.fit(X_train, y_train)
gnb.score(X_test,y_test)

0.798027503819975

In [167]:
## Support Vector Machine
from sklearn.svm import SVC
svc = SVC(kernel='rbf')
svc.fit(X_train, y_train)
svc.score(X_test,y_test)

0.8028892901791915

In [168]:
 ## RandomForest
from sklearn.ensemble import RandomForestClassifier
rf = RandomForestClassifier()
rf.fit(X_train, y_train)
rf.score(X_test,y_test)

0.8110848728990138

<h2> Mengimplementasikan Model </h2>

In [169]:
test_df = pd.read_csv('test.csv')
test_df = test_df.set_index("id")

In [170]:
test_df.head()

,Umur,Kelas Pekerja,Berat Akhir,Pendidikan,Jmlh Tahun Pendidikan,Status Perkawinan,Pekerjaan,Jenis Kelamin,Keuntungan Kapital,Kerugian Capital,Jam per Minggu
id,,,,,,,,,,,
35994,30,Pemerintah Lokal,99761,D4,11,Cerai,Pemuka Agama,Perempuan,0.0,0.0,40.0
35995,28,Wiraswasta,202206,SMA,9,Menikah,Mesin Inspeksi,Laki2,0.0,0.0,50.0
35996,34,Pemerintah Provinsi,199934,Pendidikan Tinggi,10,Menikah,Pemuka Agama,Laki2,0.0,0.0,40.0
35997,51,Wiraswasta,373448,Pendidikan Tinggi,10,Menikah,Ekesekutif Managerial,Laki2,0.0,28028000.0,40.0
35998,20,?,144685,Pendidikan Tinggi,10,Belum Pernah Menikah,?,Perempuan,0.0,22428000.0,40.0

In [171]:
test_df = test_df.drop(['Kelas Pekerja','Pendidikan','Status Perkawinan','Pekerjaan','Jenis Kelamin'], axis='columns')
test_df.head()

,Umur,Berat Akhir,Jmlh Tahun Pendidikan,Keuntungan Kapital,Kerugian Capital,Jam per Minggu
id,,,,,,
35994,30,99761,11,0.0,0.0,40.0
35995,28,202206,9,0.0,0.0,50.0
35996,34,199934,10,0.0,0.0,40.0
35997,51,373448,10,0.0,28028000.0,40.0
35998,20,144685,10,0.0,22428000.0,40.0

In [172]:
test_df2=test_df
test_df2['Gaji > 7jt'] =rf.predict(test_df2.to_numpy())

In [173]:
test_df2.head()

,Umur,Berat Akhir,Jmlh Tahun Pendidikan,Keuntungan Kapital,Kerugian Capital,Jam per Minggu,Gaji > 7jt
id,,,,,,,
35994,30,99761,11,0.0,0.0,40.0,0
35995,28,202206,9,0.0,0.0,50.0,0
35996,34,199934,10,0.0,0.0,40.0,0
35997,51,373448,10,0.0,28028000.0,40.0,0
35998,20,144685,10,0.0,22428000.0,40.0,0

In [174]:
test_df2.tail()

,Umur,Berat Akhir,Jmlh Tahun Pendidikan,Keuntungan Kapital,Kerugian Capital,Jam per Minggu,Gaji > 7jt
id,,,,,,,
45588,58,159021,5,0.0,0.0,40.0,0
45589,45,144086,7,0.0,0.0,50.0,0
45590,20,238685,10,0.0,0.0,32.0,0
45591,41,249039,9,0.0,0.0,40.0,0
45592,34,24961,9,0.0,0.0,80.0,0

In [175]:
final = test_df2.drop(['Umur','Keuntungan Kapital','Berat Akhir','Jmlh Tahun Pendidikan','Kerugian Capital','Jam per Minggu'], axis='columns')
final.head()

       Gaji > 7jt
id
35994           0
35995           0
35996           0
35997           0
35998           0

In [176]:
final['Gaji']=final['Gaji > 7jt']
final=final.drop(['Gaji > 7jt'], axis='columns')

In [177]:
final.head()

       Gaji
id
35994     0
35995     0
35996     0
35997     0
35998     0

<h2> Export File </h2>

In [178]:
final.to_csv('final6.csv')